app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Ruicong"], ["body", "This is the first comment"], ["created_at", Wed, 03 Oct 2012 06:11:24 UTC +00:00], ["post_id", 1], ["updated_at", Wed, 03 Oct 2012 06:11:24 UTC +00:00]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "3"]]
---
  def update
    @comment = Comment.find(params[:id])