app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("author", "body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Ruicong"], ["body", "This is the First post"], ["created_at", Wed, 03 Oct 2012 06:09:55 UTC +00:00], ["title", "First post"], ["updated_at", Wed, 03 Oct 2012 06:09:55 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "body" = 'This is the fourth post', "updated_at" = '2012-10-04 00:10:29.930487' WHERE "posts"."id" = 4